import React from "react";
import { Accordion, Card, Container } from "react-bootstrap";
import NavbarUI from "../component/Navbar";

const DATA = [
  {
    id: "0",
    title: "การจัดห้องให้เหมาะสมกับการนอน",
    detail:
      "จัดห้องนอนให้เหมาะสมแก่การนอน เช็ครอบห้องให้ดีอย่าให้มีเสียงรบกวนแทรกเข้ามาได้ ควรปรับอุณหภูมิห้องให้เหมาะสมไม่ร้อนหรือหนาวเกินไป สำคัญเลยคือห้องนอนควรมืดสนิท เพื่อการนอนหลับที่ดี มีประสิทธิภาพ",
  },
  {
    id: "1",
    title: "การดื่มเครื่องดื่มที่มีคาเฟอีน",
    detail: "หลีกเลี่ยงเครื่องดื่มที่มีคาเฟอีน หลังช่วงบ่ายจนถึงช่วงก่อนนอน",
  },
  {
    id: "2",
    title: "นมอุ่นๆ",
    detail: "ก่อนนอน ดื่มนมอุ่นๆ สักแก้ว จะช่วยให้หลับสบายยิ่งขึ้น",
  },
  {
    id: "3",
    title: "การนอนตอนกลางวัน",
    detail:
      "ไม่ควรงีบหลับในตอนกลางวัน เพราะอาจรบกวนการนอนในยามค่ำคืนได้  ถ้าง่วงจนทนไม่ไหวจริงๆ ก็อย่างีบหลับเกิน 1 ชั่วโมงเป็นอันขาด",
  },
  {
    id: "4",
    title: "นอนให้เพียงพอ",
    detail:
      "นอนให้เพียงพอ ไม่ได้หมายความว่าควรนอนให้เยอะที่สุด แต่ควรนอนแค่พอดี อย่านอนมากเกินไป หลังตื่นนอนควรลุกออกจากเตียง แล้วเดินไปสูดอากาศยามเช้าซะดีกว่า",
  },
  {
    id: "5",
    title: "การนอนและตื่นนอน",
    detail:
      "เข้านอน และตื่นนอนให้เป็นเวลา ทำให้ติดเป็นนิสัย ไม่ใช่ว่าคืนนี้นอนดึก พรุ่งนี้ขอตื่นสายสักนิดได้ไหม? ตอบเลยว่า ไม่ได้ ไม่งั้นอาจจะกระทบกับเวลานอน ทำให้อาการนอนไม่หลับกลับมาอีก",
  },
  {
    id: "6",
    title: "ถ้านอนไม่หลับเกิน 15-20  นาที",
    detail:
      "ควรลุกออกจากเตียงมาหากิจกรรมอย่างอื่นทำ เช่น ฟังเพลง อ่านหนังสือวิชาการหรือธรรมมะ น่าจะช่วยให้รู้สึกง่วงได้ไม่น้อย  หลีกเลี่ยงการดูโทรทัศน์หรือเล่นคอมพิวเตอร์ เพราะแสงจากจอ จะกระตุ้นให้สมองตื่นตัวได้",
  },
  {
    id: "7",
    title: "การออกกำลังกาย",
    detail:
      "ออกกำลังกายอย่างสม่ำเสมอ อย่างน้อยวันละ 30-45 นาที 3-4 วันต่อสัปดาห์ การออกกำลังกายจะช่วยลดความตึงเครียดทางอารมณ์และร่างกายได้ หากออกกำลังกายในช่วงเช้า และเย็นได้ผลดีที่สุด ไม่ควรออกกำลังกายตอนดึก หรือใกล้เวลานอน เพราะอุณหภูมิในร่างกายจะสูงขึ้นและไปกระตุ้นสมองให้ทำงาน จะทำให้เราหลับยากกว่าเดิม",
  },
];

const Suggest = () => {
  return (
    <div
      style={{
        minHeight: "100vh",
        minWidth: "100vw",
        backgroundColor: "#394046",
      }}
    >
      <NavbarUI value="3" />
      <Container>
        <Accordion defaultActiveKey="0" className="mt-5">
          {DATA.map((item, index) => {
            return (
              <Card
                key={index}
                style={{ backgroundColor: "#394046", color: "white" }}
              >
                <Accordion.Toggle
                  as={Card.Header}
                  eventKey={item.id}
                  style={{ backgroundColor: "#343a40", color: "white" }}
                >
                  {item.title}
                </Accordion.Toggle>
                <Accordion.Collapse eventKey={item.id}>
                  <Card.Body>{item.detail}</Card.Body>
                </Accordion.Collapse>
              </Card>
            );
          })}
        </Accordion>
      </Container>
    </div>
  );
};

export default Suggest;
